In [10]:
import pandas as pd

In [1]:
aantal_inwoners = {'NL':16000000, 'B': 12000000, 'F':40000000}
hoofdstad = {'NL': 'Amsterdam', 'B':'Brussel', 'F':'Parijs'}

In [4]:
df = pd.DataFrame({'aantal_inwoners':aantal_inwoners,
                   'hoofdstad':hoofdstad})

In [5]:
df

    aantal_inwoners  hoofdstad
NL         16000000  Amsterdam
B          12000000    Brussel
F          40000000     Parijs

In [13]:
df.shape

(3, 2)

In [14]:
df.ndim

2

In [15]:
df.dtypes

aantal_inwoners     int64
hoofdstad          object
dtype: object

In [16]:
df.describe()

       aantal_inwoners
count     3.000000e+00
mean      2.266667e+07
std       1.514376e+07
min       1.200000e+07
25%       1.400000e+07
50%       1.600000e+07
75%       2.800000e+07
max       4.000000e+07

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, NL to F
Data columns (total 2 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   aantal_inwoners  3 non-null      int64
 1   hoofdstad        3 non-null      object
dtypes: int64(1), object(1)
memory usage: 72.0+ bytes

In [18]:
df.size

6

In [19]:
df.head()

    aantal_inwoners  hoofdstad
NL         16000000  Amsterdam
B          12000000    Brussel
F          40000000     Parijs

In [21]:
list(df.columns)

['aantal_inwoners', 'hoofdstad']

In [23]:
list(df.index)

['NL', 'B', 'F']

In [24]:
df

    aantal_inwoners  hoofdstad
NL         16000000  Amsterdam
B          12000000    Brussel
F          40000000     Parijs

In [26]:
kentallen = {'Amsterdam': '+31 20', 'Brussel':'+32 1', 'Parijs': '+44 1'}
df_kengetallen = pd.DataFrame({'kengetallen': kentallen})
df_kengetallen

          kengetallen
Amsterdam      +31 20
Brussel         +32 1
Parijs          +44 1

In [41]:
df_hoofdstad = df.reset_index().set_index('hoofdstad')
df_hoofdstad

          index  aantal_inwoners
hoofdstad
Amsterdam    NL         16000000
Brussel       B         12000000
Parijs        F         40000000

In [43]:
df_hoofdstad.join([df_kengetallen])

          index  aantal_inwoners kengetallen
hoofdstad
Amsterdam    NL         16000000      +31 20
Brussel       B         12000000       +32 1
Parijs        F         40000000       +44 1

In [52]:
df.append(pd.Series({'aantal_inwoners':100000, 'hoofdstad':'Utrecht'}))
df

TypeError: Can only append a Series if ignore_index=True or if the Series has a name

In [46]:
df_kengetallen.reset_index(inplace=True)

In [47]:
df_kengetallen

       index kengetallen
0  Amsterdam      +31 20
1    Brussel       +32 1
2     Parijs       +44 1

In [49]:
df.merge(df_kengetallen, how='inner', left_on='hoofdstad', right_on='index')

   aantal_inwoners  hoofdstad      index kengetallen
0         16000000  Amsterdam  Amsterdam      +31 20
1         12000000    Brussel    Brussel       +32 1
2         40000000     Parijs     Parijs       +44 1

In [56]:
df3 = df.merge(df_kengetallen, how='inner', left_on='hoofdstad', right_on='index')
df3.set_index('index', inplace=True)
df3

           aantal_inwoners  hoofdstad kengetallen
index
Amsterdam         16000000  Amsterdam      +31 20
Brussel           12000000    Brussel       +32 1
Parijs            40000000     Parijs       +44 1

In [63]:
stacked = pd.DataFrame(df3.stack())
stacked

                                   0
index
Amsterdam aantal_inwoners   16000000
          hoofdstad        Amsterdam
          kengetallen         +31 20
Brussel   aantal_inwoners   12000000
          hoofdstad          Brussel
          kengetallen          +32 1
Parijs    aantal_inwoners   40000000
          hoofdstad           Parijs
          kengetallen          +44 1

In [64]:
stacked.loc[('Amsterdam','kengetallen')]

0    +31 20
Name: (Amsterdam, kengetallen), dtype: object

In [65]:
stacked.unstack()

                        0
          aantal_inwoners  hoofdstad kengetallen
index
Amsterdam        16000000  Amsterdam      +31 20
Brussel          12000000    Brussel       +32 1
Parijs           40000000     Parijs       +44 1

In [66]:
df3

           aantal_inwoners  hoofdstad kengetallen
index
Amsterdam         16000000  Amsterdam      +31 20
Brussel           12000000    Brussel       +32 1
Parijs            40000000     Parijs       +44 1

In [69]:
df3.pivot(index='hoofdstad',columns='kengetallen',values='aantal_inwoners')

kengetallen      +31 20       +32 1       +44 1
hoofdstad
Amsterdam    16000000.0         NaN         NaN
Brussel             NaN  12000000.0         NaN
Parijs              NaN         NaN  40000000.0

In [72]:
df3.melt(id_vars='hoofdstad')

   hoofdstad         variable     value
0  Amsterdam  aantal_inwoners  16000000
1    Brussel  aantal_inwoners  12000000
2     Parijs  aantal_inwoners  40000000
3  Amsterdam      kengetallen    +31 20
4    Brussel      kengetallen     +32 1
5     Parijs      kengetallen     +44 1